university_knowledge = """
Самарский государственный технический университет расположен по адресу: ул. Молодогвардейская, 244. 
Главный корпус находится на улице Галактионовская, 141. Деканат факультета информатики находится на 3 этаже главного корпуса.
Библиотека работает с понедельника по пятницу с 9:00 до 18:00, в субботу с 10:00 до 16:00.
Стоимость обучения на бакалавриате составляет 150000 рублей в год, на магистратуре - 170000 рублей в год.
Телефон приемной комиссии: +7 (846) 207-88-88. Email: priem@samgtu.ru.
Общежитие для студентов расположено по адресу: ул. Спортивная, 21. Стоимость проживания - 2000 рублей в месяц.
"""

questions = [
        "Где находится деканат факультета информатики?",
        "Сколько стоит обучение на бакалавриате?",
        "Какие часы работы библиотеки?",
        "Какой телефон приемной комиссии?",
        "Где находится общежитие для студентов?"
    ]